In [1]:
import pandas as pd

In [2]:
friend_dict = [
    {'name' : 'Chan', 'age' : 17, 'job' : 'stu'},
    {'name' : 'Hong', 'age' : 20, 'job' : 'tea'}
]

In [3]:
df = pd.DataFrame(friend_dict)

In [4]:
df

   name  age  job
0  Chan   17  stu
1  Hong   20  tea

원래 딕셔너리로 하면 컬럼 값이 위처럼 안될때가 많다고 함 -> Key 순서 보장 x

In [5]:
df = df[['name','age','job']]

In [6]:
df

   name  age  job
0  Chan   17  stu
1  Hong   20  tea

위의 과정이 귀찮으면 아래와 같이 하면 된다.   
collections를 사용 -> key 순서 보장 o

In [7]:
from collections import OrderedDict

In [8]:
info = OrderedDict(
    [
        ('name', ['Chan', 'Kim']),
        ('age', [17, 20]),
        ('jog', ['stu', 'tea'])
    ]
)

In [9]:
df = pd.DataFrame.from_dict(info)

In [10]:
df

   name  age  jog
0  Chan   17  stu
1   Kim   20  tea

위와 같이 잘 들어가는 것을 확인 할 수 있다.  
순서 보장

In [11]:
friend_list = [
    ['Chan',17,'stu'],
    ['Kim',20,'tea']
]

In [12]:
column_name = ['name', 'age', 'job']

In [13]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [14]:
df.head()

   name  age  job
0  Chan   17  stu
1   Kim   20  tea

위 또한 귀찮다면 아래와 같이 하면 된다.

In [15]:
friend_list = [
    ['name', ['Chan','Kim']],
    ['age', [17, 20]],
    ['job', ['stu', 'tea']]
]

In [20]:
df = pd.DataFrame.from_dict(dict(friend_list))

In [21]:
df

   name  age  job
0  Chan   17  stu
1   Kim   20  tea